#include "include.h"

/************************************************************************************************************************************
                                                            初始化				
************************************************************************************************************************************/	

			void All_Init(void)
			{
				       
				NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);           
				
				LED_Init();
				
				uart_init(9600);                    //无线通讯模块
				
				CAN_Mode_Init(CAN_SJW_1tq,CAN_BS2_8tq,CAN_BS1_9tq,4,CAN_Mode_Normal);
				
				TIM3_IT_Init(99,7199);
				
			}

